environments_harbor/wrk_http_benchmarking_medium/environment/data/endpoint_b.log
Running 30s test @ http://api/endpoint_b
  2 threads and 10 connections
  Thread calibration: mean lat.: 8.450ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 8.320ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     8.23ms    3.45ms  145.60ms   96.50%
    Req/Sec     1150.75   95.20   1450.00   88.30%
  Latency Distribution (HdrHistogram - Recorded Latency)
   50.000%    7.89ms
   75.000%    9.12ms
   90.000%   11.45ms
   99.000%   18.76ms
   99.900%   42.33ms
   99.990%   98.75ms
   99.999%  142.21ms
  100.000%  145.60ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       5.123     0.000000            1         1.00
       6.247     0.100000         3458         1.11
       6.891     0.200000         6912         1.25
       7.345     0.300000        10368         1.43
       7.623     0.400000        13824         1.67
       7.891     0.500000        17280         2.00
       8.067     0.550000        19008         2.22
       8.245     0.600000        20736         2.50
       8.456     0.650000        22464         2.86
       8.789     0.700000        24192         3.33
       9.123     0.750000        25920         4.00
       9.345     0.775000        26784         4.44
       9.567     0.800000        27648         5.00
       9.823     0.825000        28512         5.71
      10.156     0.850000        29376         6.67
      10.567     0.875000        30240         8.00
      10.891     0.887500        30672         8.89
      11.234     0.900000        31104        10.00
      11.678     0.912500        31536        11.43
      12.234     0.925000        31968        13.33
      12.923     0.937500        32400        16.00
      13.456     0.943750        32616        17.78
      14.123     0.950000        32832        20.00
      14.890     0.956250        33048        22.86
      15.789     0.962500        33264        26.67
      16.891     0.968750        33480        32.00
      17.567     0.971875        33588        35.56
      18.456     0.975000        33696        40.00
      19.567     0.978125        33804        45.71
      21.123     0.981250        33912        53.33
      23.456     0.984375        34020        64.00
      25.234     0.985937        34074        71.11
      27.891     0.987500        34128        80.00
      31.234     0.989062        34182        91.43
      35.678     0.990625        34236       106.67
      40.123     0.992187        34290       128.00
      42.891     0.992969        34317       142.22
      46.234     0.993750        34344       160.00
      51.567     0.994531        34371       182.86
      58.234     0.995313        34398       213.33
      66.891     0.996094        34425       256.00
      72.345     0.996484        34439       284.44
      78.891     0.996875        34452       320.00
      85.678     0.997266        34466       365.71
      92.456     0.997656        34479       426.67
     101.234     0.998047        34493       512.00
     106.789     0.998242        34500       568.89
     112.345     0.998437        34506       640.00
     118.901     0.998633        34513       731.43
     125.678     0.998828        34520       853.33
     132.456     0.999023        34527      1024.00
     136.234     0.999121        34530      1137.78
     139.789     0.999219        34534      1280.00
     141.567     0.999316        34537      1462.86
     142.891     0.999414        34541      1706.67
     143.678     0.999512        34544      2048.00
     144.234     0.999561        34546      2275.56
     144.567     0.999609        34548      2560.00
     144.891     0.999658        34550      2925.71
     145.123     0.999707        34551      3413.33
     145.234     0.999756        34553      4096.00
     145.345     0.999780        34554      4551.11
     145.456     0.999805        34555      5120.00
     145.567     0.999829        34556      5851.43
     145.601     0.999854        34557      6826.67

#[Mean    =        8.234, StdDeviation   =        3.451]
#[Max     =      145.600, Total count    =        34520]
#[Buckets =           27, SubBuckets     =         2048]

  34520 requests in 30.00s, 2.10MB read
Requests/sec:   1150.67
Transfer/sec:     71.85KB